title: File Provider
description: ''
payload:
  payloadtype: com.apple.fileproviderd
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '11.0'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: true
      allowmanualinstall: false
      userenrollment:
        mode: allowed
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: AllowManagedFileProvidersToRequestAttribution
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', enables file providers access to the path of the requesting
    process.
- key: ManagementAllowsKnownFolderSyncing
  supportedOS:
    macOS:
      introduced: '15.2'
      devicechannel: true
      userchannel: false
      userenrollment:
        mode: forbidden
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', the device prevents the File Provider extension using desktop
    and documents synchronization in any app. If 'true', the device allows File Provider
    extension desktop and documents synchronization. This does not impact the ability
    for apps to utilize the File Provider extension for file and folder syncing with
    remote storage.
- key: ManagementKnownFolderSyncingAllowList
  supportedOS:
    macOS:
      introduced: '15.2'
      devicechannel: true
      userchannel: false
      userenrollment:
        mode: forbidden
  type: <array>
  presence: optional
  content: An array of app identifiers for apps that are allowed to utilize File Provider
    extension desktop and documents synchronization. If present, and `ManagementAllowsKnownFolderSyncing`
    is set to `true`, the device allows only the apps in this list to use desktop
    and documents synchronization. This key is ignored if `ManagementAllowsKnownFolderSyncing`
    is set to `false`. This setting does not impact the ability for apps to utilize
    File Provider extension for volume access. The format of the app identifiers is
    "Bundle.Identifier (TeamIdentifier)".
  subkeys:
  - key: AllowListItem
    type: <string>
    presence: required
    content: A composed app identifier. The format is "Bundle.Identifier (TeamIdentifier)".
