title: '802.1X: Global Ethernet'
description: ''
payload:
  payloadtype: com.apple.globalethernet.managed
  supportedOS:
    iOS:
      introduced: '17.0'
      multiple: false
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: true
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.13'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '17.0'
      multiple: false
      supervised: false
      allowmanualinstall: true
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: ANY
  type: <any>
  presence: optional
  content: Keys relevant to 802.1X configuration. User enrollment payloads don't support
    the various proxy keys, including 'ProxyType', 'ProxyServer', 'ProxyServerPort',
    'ProxyUsername', 'ProxyPassword', 'ProxyPACURL' and 'ProxyPACFallbackAllowed'.
