title: 'Certificate (PKCS #12)'
description: Use this section to define settings for a pkcs12 certificate.
payload:
  payloadtype: com.apple.security.pkcs12
  supportedOS:
    iOS:
      introduced: '4.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.7'
      multiple: true
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '9.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
    visionOS:
      introduced: '1.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    watchOS:
      introduced: '3.0'
      multiple: true
      allowmanualinstall: true
  content: Password-protected identity certificate. Only one certificate may be included.
payloadkeys:
- key: PayloadCertificateFileName
  title: Payload Certificate Filename
  type: <string>
  presence: optional
  content: The file name of the enclosed certificate.
- key: PayloadContent
  title: Payload Certificate Data
  type: <data>
  presence: required
  content: The binary representation of the payload, encoded in Base64.
- key: Password
  title: Password
  type: <string>
  presence: optional
  content: The password to the identity.
- key: AllowAllAppsAccess
  title: Allow All Apps Access
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.10'
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system allows apps access to the private key. Available
    in macOS 10.10 and later.
- key: KeyIsExtractable
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.15'
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', the system doesn't tag the private key data as extractable
    in the keychain.
