title: 'Login Items: Managed Items'
description: ''
payload:
  payloadtype: com.apple.loginitems.managed
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.13'
      multiple: true
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: This payload handles login items usage on macOS.
payloadkeys:
- key: AutoLaunchedApplicationDictionary-managed
  type: <array>
  presence: required
  content: An array of login item dictionaries.
  subkeys:
  - key: LoginItem
    type: <dictionary>
    presence: required
    content: A login item.
    subkeys:
    - key: Path
      type: <string>
      presence: required
      content: The URL or path string to the item's location.
    - key: Hide
      type: <boolean>
      presence: optional
      default: false
      content: If 'true', the system hides this item in the Users & Groups login items
        list.
