title: 'Media Management: Disc Burning'
description: ''
payload:
  payloadtype: com.apple.DiscRecording
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.7'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: BurnSupport
  type: <string>
  presence: required
  rangelist:
  - 'off'
  - authenticate
  - 'on'
  content: |-
    Configure disc-burn. Allowed values:

    * 'off': The system disables disc burning.
    * 'on': The system allows normal default operation. Setting this key to 'on' doesn't enable disc burn support if other mechanisms or preferences disabled it. Needs to be enabled with the Finder profile.
    * 'authenticate': The system requires authentication.
