title: Exchange ActiveSync
description: Use this section to define settings for the Exchange ActiveSync account.
payload:
  payloadtype: com.apple.eas.account
  supportedOS:
    iOS:
      introduced: '4.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: false
        userchannel: true
      userenrollment:
        mode: allowed
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '1.1'
      multiple: true
      supervised: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    watchOS:
      introduced: n/a
  content: |-
    This payload configures an Exchange Active Sync account on an iOS device for Mail, Contacts, Calendars, Reminders, and Notes.
    Updating this payload overrides any settings that the user customized, such as EnableMail/Contacts/Calendars/Reminders/Notes and MailNumberOfPastDaysToSync.
payloadkeys:
- key: EmailAddress
  title: Email Address
  type: <string>
  presence: optional
  content: The full email address for the account. If not present in the payload,
    the device prompts for this string during profile installation.
- key: Host
  title: Exchange ActiveSync Host
  type: <string>
  presence: optional
  content: The Exchange server host name or IP address.
- key: SSL
  title: Use SSL
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system enables SSL for authentication.
- key: OAuth
  title: Use OAuth
  supportedOS:
    iOS:
      introduced: '12.0'
  type: <boolean>
  presence: optional
  default: false
  content: |-
    If 'true', enables OAuth for authentication. If enabled, don't specify a password.
    Available only in iOS 12.0 and above.
- key: UserName
  title: User
  type: <string>
  presence: optional
  content: This user name for this Exchange account. Required for noninteractive installations
    like MDM in iOS.
- key: Password
  title: Password
  type: <string>
  presence: optional
  content: The password of the account. Use only with encrypted profiles.
- key: Certificate
  title: Authentication Credential
  supportedOS:
    iOS:
      introduced: '7.0'
  type: <data>
  presence: optional
  content: The '.p12' identity certificate in NSData blob format, for accounts that
    allow authentication via certificate.
- key: CertificateName
  title: Authentication Credential Name
  supportedOS:
    iOS:
      introduced: '7.0'
  type: <string>
  presence: optional
  content: The name or description of the certificate.
- key: CertificatePassword
  title: Authentication Credential Password
  type: <string>
  presence: optional
  content: The password necessary for the '.p12' identity certificate. Used with mandatory
    encryption of profiles.
- key: PreventMove
  title: Prevent Move
  supportedOS:
    iOS:
      introduced: '5.0'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system prevents moving messages from out of this email account
    into another account. This setting also prevents forwarding or replying from an
    account other than the recipient of the message.
- key: PreventAppSheet
  title: Prevent App Sheet
  supportedOS:
    iOS:
      introduced: '5.0'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', prevents this account from sending mail in any app other than
    the Apple Mail app.
- key: PayloadCertificateUUID
  title: Payload Certificate UUID
  type: <string>
  presence: optional
  format: ^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$
  content: The UUID of the certificate payload within the same profile to use for
    the identity credential. If this field is present, the Certificate field isn't
    used.
- key: SMIMEEnabled
  title: S/MIME Enabled
  supportedOS:
    iOS:
      introduced: '5.0'
      deprecated: '10.0'
    visionOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system enables S/MIME encryption. In iOS 10.0 and later,
    this key is ignored. Use 'SMIMESigningEnabled' instead.
- key: SMIMESigningEnabled
  title: S/MIME Signing Enabled
  supportedOS:
    iOS:
      introduced: '10.3'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system enables S/MIME signing for this account. Available
    in iOS 10.0 and later.
- key: SMIMESigningCertificateUUID
  title: S/MIME Signing Certificate
  supportedOS:
    iOS:
      introduced: '5.0'
  type: <string>
  presence: optional
  format: ^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$
  content: The UUID of the identity certificate used to sign messages sent from this
    account.
- key: SMIMEEncryptionEnabled
  title: S/MIME Encryption Enabled
  supportedOS:
    iOS:
      introduced: '10.3'
      deprecated: '12.0'
    visionOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system enables S/MIME encryption for this account. Available
    in iOS 10.0 and later. As of iOS 12.0, this key is deprecated. Use 'SMIMEEncryptByDefault'
    instead.
- key: SMIMEEncryptionCertificateUUID
  title: S/MIME Encryption Certificate
  supportedOS:
    iOS:
      introduced: '5.0'
  type: <string>
  presence: optional
  format: ^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$
  content: The payload UUID of the identity certificate used to decrypt messages sent
    to this account. The system attaches the public certificate to outgoing mail to
    allow the user to receive encrypted mail. When the user sends encrypted mail,
    the system uses the public certificate to encrypt the copy of the mail in the
    user's Sent mailbox.
- key: SMIMEEnablePerMessageSwitch
  title: S/MIME Enable Per-Message Switch
  supportedOS:
    iOS:
      introduced: '8.0'
      deprecated: '12.0'
    visionOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: |-
    If 'true', the system displays the per-message encryption switch in the Mail Compose UI.
    Available in iOS 8.0 and later. As of iOS 12.0, this key is deprecated. Use 'SMIMEEnableEncryptionPerMessageSwitch' instead.
- key: disableMailRecentsSyncing
  title: Disable Mail Recents Syncing
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system excludes this account from Recent Addresses syncing.
- key: MailNumberOfPastDaysToSync
  title: Past Days of Mail to Sync
  type: <integer>
  presence: optional
  rangelist:
  - 0
  - 1
  - 3
  - 7
  - 14
  - 31
  default: 7
  content: |-
    The number of days in the past to sync mail on the device.
    For no limit, use the value '0'.
- key: HeaderMagic
  supportedOS:
    iOS:
      deprecated: '7.0'
    visionOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The value of the 'X-Apple-Config-Magic' header in each EAS HTTP request.
- key: CommunicationServiceRules
  title: Communication Service Rules
  supportedOS:
    iOS:
      introduced: '10.0'
  type: <dictionary>
  presence: optional
  content: The communication service handler rules for this account.
  subkeys:
  - key: DefaultServiceHandlers
    title: Default Service Handlers
    supportedOS:
      iOS:
        introduced: '10.0'
    type: <dictionary>
    presence: optional
    content: The default handlers to use for contacts from this account.
    subkeys:
    - key: AudioCall
      title: App for audio calls
      supportedOS:
        iOS:
          introduced: '10.0'
      type: <string>
      presence: optional
      content: The bundle identifier of the default application to use for audio calls
        made to contacts from this account.
- key: allowMailDrop
  title: Allow Mail Drop
  supportedOS:
    iOS:
      introduced: '9.2'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system enables this account to use Mail Drop.
- key: SMIMESigningUserOverrideable
  supportedOS:
    iOS:
      introduced: '12.0'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the user can turn S/MIME signing on or off in Settings. Available
    in iOS 12.0 and later.
- key: SMIMESigningCertificateUUIDUserOverrideable
  supportedOS:
    iOS:
      introduced: '12.0'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the user can select the signing identity. Available in iOS 12.0
    and later.
- key: SMIMEEncryptByDefault
  supportedOS:
    iOS:
      introduced: '12.0'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system enables S/MIME encryption by default. If 'SMIMEEnableEncryptionPerMessageSwitch'
    is 'false', the user can't change this default. Available in iOS 12.0 and later.
- key: SMIMEEncryptByDefaultUserOverrideable
  supportedOS:
    iOS:
      introduced: '12.0'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system enables encryption by default and the user can't
    change it. Available in iOS 12.0 and later.
- key: SMIMEEncryptionCertificateUUIDUserOverrideable
  supportedOS:
    iOS:
      introduced: '12.0'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the user can select the S/MIME encryption identity, and encryption
    is on.Available in iOS 12.0 and later.
- key: SMIMEEnableEncryptionPerMessageSwitch
  supportedOS:
    iOS:
      introduced: '12.0'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system displays the per-message encryption switch in the
    Mail Compose UI. Available in iOS 12.0 and later.
- key: EnableMail
  supportedOS:
    iOS:
      introduced: '13.0'
  type: <boolean>
  presence: optional
  default: true
  content: |-
    If 'false', the system disables the Mail service for this account. The user can reenable Mail service in Settings unless 'EnableMailUserOverridable' is 'false'.
    At least of the following fields needs to be 'true': 'EnableMail', 'EnableContacts', 'EnableCalendars', 'EnableReminders', and 'EnableNotes'.
- key: EnableContacts
  supportedOS:
    iOS:
      introduced: '13.0'
  type: <boolean>
  presence: optional
  default: true
  content: |-
    If 'false', the system disables the Contacts service for this account. The user can reenable Contacts service in Settings unless 'EnableContactsUserOverridable' is 'false'.
    At least of the following fields needs to be 'true': 'EnableMail', 'EnableContacts', 'EnableCalendars', 'EnableReminders', and 'EnableNotes'.
- key: EnableCalendars
  supportedOS:
    iOS:
      introduced: '13.0'
  type: <boolean>
  presence: optional
  default: true
  content: |-
    If 'false', the system disables the Calendars service for this account. The user can reenable Calendars service in Settings unless 'EnableCalendarsUserOverridable' is 'false'.
    At least of the following fields needs to be 'true': 'EnableMail', 'EnableContacts', 'EnableCalendars', 'EnableReminders', and 'EnableNotes'.
- key: EnableReminders
  supportedOS:
    iOS:
      introduced: '13.0'
  type: <boolean>
  presence: optional
  default: true
  content: |-
    If 'false', the system disables the Reminders service for this account. The user can reenable Reminders service in Settings unless 'EnableRemindersUserOverridable' is 'false'.
    At least of the following fields needs to be 'true': 'EnableMail', 'EnableContacts', 'EnableCalendars', 'EnableReminders', and 'EnableNotes'.
- key: EnableNotes
  supportedOS:
    iOS:
      introduced: '13.0'
  type: <boolean>
  presence: optional
  default: true
  content: |-
    If 'false', the system disables the Notes service for this account. The user can reenable Notes service in Settings unless 'EnableNotesUserOverridable' is 'false'.
    At least of the following fields needs to be 'true': 'EnableMail', 'EnableContacts', 'EnableCalendars', 'EnableReminders', and 'EnableNotes'.
- key: EnableMailUserOverridable
  supportedOS:
    iOS:
      introduced: '13.0'
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', the system prevents the user from changing the state of the
    Mail service for this account in Settings.
- key: EnableContactsUserOverridable
  supportedOS:
    iOS:
      introduced: '13.0'
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', the system prevents the user from changing the state of the
    Contacts service for this account in Settings.
- key: EnableCalendarsUserOverridable
  supportedOS:
    iOS:
      introduced: '13.0'
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', the system prevents the user from changing the state of the
    Calendars service for this account in Settings.
- key: EnableRemindersUserOverridable
  supportedOS:
    iOS:
      introduced: '13.0'
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', the system prevents the user from changing the state of the
    Reminders service for this account in Settings.
- key: EnableNotesUserOverridable
  supportedOS:
    iOS:
      introduced: '13.0'
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', prevents the user from changing the state of the Notes service
    for this account in Settings.
- key: OAuthSignInURL
  supportedOS:
    iOS:
      introduced: '13.0'
  type: <string>
  presence: optional
  content: The URL that this account should use for signing in through OAuth. Ignored
    unless 'OAuth' is 'true'. If you specify this URL, auto-discovery isn't used for
    this account, so you need to also specify a host.
- key: OAuthTokenRequestURL
  supportedOS:
    iOS:
      introduced: '13.0'
  type: <string>
  presence: optional
  content: The URL that this account should use for token requests through OAuth.
    Ignored unless 'OAuth' is 'true'.
- key: OverridePreviousPassword
  supportedOS:
    iOS:
      introduced: '14.0'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system overrides the previous user/EAS password with the
    new EAS password in the payload. Available in iOS 14 and later.
- key: VPNUUID
  title: VPNUUID
  supportedOS:
    iOS:
      introduced: '14.0'
  type: <string>
  presence: optional
  content: The VPNUUID of the per-app VPN the account uses for network communication.
    Available in iOS 14 and later.
