title: '802.1X: First Ethernet'
description: ''
payload:
  payloadtype: com.apple.firstethernet.managed
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.7'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: ANY
  type: <any>
  presence: optional
  content: Keys relevant to 802.1x configuration.  User enrollment payloads do not
    support the various proxy keys including ProxyType, ProxyServer, ProxyServerPort,
    ProxyUsername, ProxyPassword,, ProxyPACURL and ProxyPACFallbackAllowed.
