title: System Policy Managed
description: ''
payload:
  payloadtype: com.apple.systempolicy.managed
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.8'
      multiple: true
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Provides a way of disabling the Finder's contextual menu that allows bypass
    of System Policy restrictions.
payloadkeys:
- key: DisableOverride
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', disables the Finder's contextual menu item.
