title: Status Device Battery Health
description: The health of the battery.
payload:
  statusitemtype: device.power.battery-health
  supportedOS:
    iOS:
      introduced: '17.0'
      allowed-enrollments:
      - supervised
      - device
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
    macOS:
      introduced: '14.4'
      allowed-enrollments:
      - supervised
      - local
      allowed-scopes:
      - system
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: device.power.battery-health
  title: Status item value.
  type: <string>
  presence: required
  rangelist:
  - non-genuine
  - normal
  - service-recommended
  - unknown
  - unsupported
  content: |-
    The battery health status, which has the following values:

    * 'non-genuine': The battery isn't a genuine Apple battery.
    * 'normal': The battery is operating normally.
    * 'service-recommended': The system recommends battery service.
    * 'unknown': The system couldn't determine battery health information.
    * 'unsupported': The device doesn't support battery health reporting.

    Available in iOS 17 and later on iPhone, iPadOS 18.4 and later on supported iPad models, and macOS 14.4 and later on Apple silicon Mac computers.
