title: Status Software Update Failure Reason
description: The software update failure reason state.
payload:
  statusitemtype: softwareupdate.failure-reason
  supportedOS:
    iOS:
      introduced: '17.0'
      allowed-enrollments:
      - supervised
      - device
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
    macOS:
      introduced: '14.0'
      allowed-enrollments:
      - supervised
      allowed-scopes:
      - system
    tvOS:
      introduced: '18.4'
      allowed-enrollments:
      - supervised
      - device
      allowed-scopes:
      - system
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: softwareupdate.failure-reason
  title: The software update failure reason state.
  type: <dictionary>
  presence: required
  content: Details about a software update failure.
  subkeytype: Dictionary
  subkeys:
  - key: count
    title: The software update failure count.
    type: <integer>
    presence: required
    content: The number of times the current software update failed. If there are
      no failures, or no pending software update, this is '0'.
  - key: reason
    title: The reason for the software update failure.
    type: <string>
    presence: optional
    content: If present, this describes the reason for last software update failure.
      This key isn't present if there are no failures or no pending software update.
  - key: timestamp
    title: The timestamp of the software update failure.
    type: <string>
    presence: optional
    content: If present, this is the RFC 3339 timestamp of the last software update
      failure. This key isn't present if there are no failures or no pending software
      update.
