title: Status Software Update Device ID
description: The device's software update device ID.
payload:
  statusitemtype: softwareupdate.device-id
  supportedOS:
    iOS:
      introduced: '18.0'
      allowed-enrollments:
      - supervised
      - device
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
    macOS:
      introduced: '15.0'
      allowed-enrollments:
      - supervised
      allowed-scopes:
      - system
    tvOS:
      introduced: '18.4'
      allowed-enrollments:
      - supervised
      - device
      allowed-scopes:
      - system
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: softwareupdate.device-id
  title: The device's software update device ID.
  type: <string>
  presence: required
  content: The device identifier to use when looking up available software updates
    via 'https://gdmf.apple.com/v2/pmv'.
