title: Request Mirroring Command
description: This command prompts the user to share their screen using AirPlay mirroring.
payload:
  requesttype: RequestMirroring
  supportedOS:
    iOS:
      introduced: '7.0'
      accessrights: None
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.10'
      accessrights: None
      devicechannel: true
      userchannel: false
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: This command prompts the user to share their screen using AirPlay Mirroring.
payloadkeys:
- key: DestinationName
  type: <string>
  presence: optional
  content: The name of the AirPlay Mirroring destination.
- key: DestinationDeviceID
  type: <string>
  presence: optional
  content: The hardware address of the AirPlay Mirroring destination that identifies
    the device, in the format 'xx:xx:xx:xx:xx'. This value isn't case-sensitive.
- key: ScanTime
  type: <integer>
  presence: optional
  content: The number of seconds, from '10' to '300', for the device to spend searching
    for the destination. The default value is '30'.
- key: Password
  type: <string>
  presence: optional
  content: The screen-sharing password that the device uses when connecting to the
    destination.
responsekeys:
- key: MirroringResult
  type: <string>
  presence: optional
  content: |-
    The result of the request. One of these values:
    * 'Prompting': The user is receiving a prompt to share their screen.
    * 'DestinationNotFound': The device is unable to reach the destination.
    * 'Cancelled': The user canceled the request.
    * 'Unknown': An unknown error occurred.
